; domain
(define (domain overcooked-sopa)
    (:requirements :typing :negative-preconditions :equality :fluents)
    (:types
        multiutil ingrediente cocinero zona localizacion movible lavable cortable - object
        cebolla tomate champinion - ingrediente
        cambiador limbo encimera cinta tabla-corte fogon fregadero pila entregador armario - localizacion
        multiolla - multiutil
        multiutil plato ingrediente - movible
        multiutil plato - lavable
    )

    (:predicates
        (en ?cocinero - cocinero ?localizacion - localizacion)
        (pertenece ?localizacion - localizacion ?zona - zona)
        (esta ?cocinero - cocinero ?zona - zona)
        (conectadas ?zona1 ?zona2 - zona)
        (libre ?cocinero - cocinero)
        (lleva ?cocinero - cocinero ?movible - movible)

        (ocupada ?localizacion - localizacion)

        (sobre ?movible - movible ?localizacion - localizacion)
        (prohibido-dejar ?localizacion - localizacion)

        (entregado ?plato - plato)
        (sucio ?lavable - lavable)
        (vacio ?lavable - lavable)

        (emplatado3 ?ingrediente1 ?ingrediente2 ?ingrediente3 - ingrediente ?plato - plato)
        (echado-multiple ?ingrediente - ingrediente ?multiutil - multiutil)
        (cortado ?ingrediente - ingrediente)
        (cocido3 ?ingrediente1 ?ingrediente2 ?ingrediente3 - ingrediente)

        (sopa-tomate ?plato - plato)
        (sopa-cebolla ?plato - plato)
        (sopa-champinion ?plato - plato)
    )

    (:functions
        (ingredientes ?lavable - lavable) - number
    )
    
    (:action emplatar-util3
        :parameters (?cocinero - cocinero ?plato - plato ?encimera - encimera ?multiutil - multiutil ?ingrediente1 ?ingrediente2 ?ingrediente3 - ingrediente)
        :precondition (and
            (sobre ?plato ?encimera)
            (not (sucio ?plato))
            (en ?cocinero ?encimera)
            (lleva ?cocinero ?multiutil)
            (echado-multiple ?ingrediente1 ?multiutil)
            (echado-multiple ?ingrediente2 ?multiutil)
            (echado-multiple ?ingrediente3 ?multiutil)
        )
        :effect (and
            (not (echado-multiple ?ingrediente1 ?multiutil))
            (not (echado-multiple ?ingrediente2 ?multiutil))
            (not (echado-multiple ?ingrediente3 ?multiutil))
            (vacio ?multiutil)
            (sucio ?multiutil)
            (decrease (ingredientes ?multiutil) 3)
            (not (vacio ?plato))
            (increase (ingredientes ?plato) 3)
            (emplatado3 ?ingrediente1 ?ingrediente2 ?ingrediente3 ?plato)
        )
    )

    (:action echar-multiple
        :parameters (?cocinero - cocinero ?ingrediente - ingrediente ?multiutil - multiutil ?localizacion - localizacion)
        :precondition (and
            (sobre ?multiutil ?localizacion)
            (not (sucio ?multiutil))
            (en ?cocinero ?localizacion)
            (lleva ?cocinero ?ingrediente)
            (< (ingredientes ?multiutil) 3)
        )
        :effect (and
            (libre ?cocinero)
            (not (lleva ?cocinero ?ingrediente))
            (not (vacio ?multiutil))
            (echado-multiple ?ingrediente ?multiutil)
            (increase (ingredientes ?multiutil) 1)
        )
    )

    (:action cortar
        :parameters (?cocinero - cocinero ?ingrediente - ingrediente ?tabla-corte - tabla-corte)
        :precondition (and
            (sobre ?ingrediente ?tabla-corte)
            (en ?cocinero ?tabla-corte)
            (libre ?cocinero)
        )
        :effect (cortado ?ingrediente)
    )

    (:action cocer3
        :parameters (?cocinero - cocinero ?ingrediente1 ?ingrediente2 ?ingrediente3 - ingrediente ?multiolla - multiolla ?fogon - fogon)
        :precondition (and
            (echado-multiple ?ingrediente1 ?multiolla)
            (echado-multiple ?ingrediente2 ?multiolla)
            (echado-multiple ?ingrediente3 ?multiolla)
            (sobre ?multiolla ?fogon)
            (en ?cocinero ?fogon)
            (libre ?cocinero)
        )
        :effect (cocido3 ?ingrediente1 ?ingrediente2 ?ingrediente3)
    )

    (:action lavar
        :parameters (?cocinero - cocinero ?lavable - lavable ?fregadero - fregadero)
        :precondition (and
            (vacio ?lavable)
            (sobre ?lavable ?fregadero)
            (en ?cocinero ?fregadero)
            (libre ?cocinero)
        )
        :effect (not (sucio ?lavable))
    )

    (:action mover
        :parameters (?cocinero - cocinero ?l1 ?l2 - localizacion ?zona - zona)
        :precondition (and
            (en ?cocinero ?l1)
            (pertenece ?l2 ?zona)
            (esta ?cocinero ?zona)
        )
        :effect (and
            (not (en ?cocinero ?l1))
            (en ?cocinero ?l2)
        )
    )

    (:action cambiar
        :parameters (?cocinero - cocinero ?limbo1 ?limbo2 - limbo ?zona1 ?zona2 - zona)
        :precondition (and
            (en ?cocinero ?limbo1)
            (pertenece ?limbo1 ?zona1)
            (pertenece ?limbo2 ?zona2)
            (esta ?cocinero ?zona1)
            (conectadas ?zona1 ?zona2)
        )
        :effect (and
            (not (en ?cocinero ?limbo1))
            (not (esta ?cocinero ?zona1))
            (en ?cocinero ?limbo2)
            (esta ?cocinero ?zona2)
        )
    )

    ; (:action cambiar-zona
    ;     :parameters (?cocinero1 ?cocinero2 - cocinero ?cambiador - cambiador ?zona1 ?zona2 - zona ?zona-intercambio - zona-intercambio)
    ;     :precondition (and
    ;         (en ?cocinero1 ?cambiador)
    ;         (pertenece ?cambiador ?zona1)
    ;         (not (pertenece ?cambiador ?zona2))
    ;         (not (pertenece ?cambiador ?zona-intercambio))

    ;         (esta ?cocinero1 ?zona1)
    ;         (esta ?cocinero1 ?zona-intercambio)
    ;         (not (esta ?cocinero1 ?zona2))

    ;         (not (esta ?cocinero2 ?zona1))
    ;         (not (esta ?cocinero2 ?zona-intercambio))
    ;         (esta ?cocinero2 ?zona2)
    ;     )
    ;     :effect (and
    ;         (not (esta ?cocinero1 ?zona-intercambio))
    ;         (esta ?cocinero2 ?zona-intercambio)
    ;     )
    ; )

    (:action coger
        :parameters (?cocinero - cocinero ?movible - movible ?localizacion - localizacion)
        :precondition (and
            (en ?cocinero ?localizacion)
            (libre ?cocinero)
            (sobre ?movible ?localizacion)
        )
        :effect (and
            (not (ocupada ?localizacion))
            (not (sobre ?movible ?localizacion))
            (lleva ?cocinero ?movible)
            (not (libre ?cocinero))
        )
    )

    (:action dejar
        :parameters (?cocinero - cocinero ?movible - movible ?localizacion - localizacion)
        :precondition (and
            (not (prohibido-dejar ?localizacion))
            (not (ocupada ?localizacion))
            (en ?cocinero ?localizacion)
            (lleva ?cocinero ?movible)
        )
        :effect (and
            (ocupada ?localizacion)
            (sobre ?movible ?localizacion)
            (not (lleva ?cocinero ?movible))
            (libre ?cocinero)
        )
    )

    (:action entregar
        :parameters (?cocinero - cocinero ?plato - plato ?entregador - entregador)
        :precondition (and
            (en ?cocinero ?entregador)
            (not (sucio ?plato))
            (lleva ?cocinero ?plato)
        )
        :effect (and
            (entregado ?plato)
            (not (lleva ?cocinero ?plato))
            (libre ?cocinero)
        )
    )

    (:action hacer-sopa-tomate
        :parameters (?plato - plato ?pila - pila ?tomate1 ?tomate2 ?tomate3 - tomate)
        :precondition (and
            (not (= ?tomate1 ?tomate2))
            (not (= ?tomate2 ?tomate3))
            (not (= ?tomate1 ?tomate3))
            (cortado ?tomate1)
            (cortado ?tomate2)
            (cortado ?tomate3)
            (cocido3 ?tomate1 ?tomate2 ?tomate3)
            (emplatado3 ?tomate1 ?tomate2 ?tomate3 ?plato)
            (entregado ?plato)
            (not (sucio ?plato))
            (= (ingredientes ?plato) 3)
        )
        :effect (and
            (not (emplatado3 ?tomate1 ?tomate2 ?tomate3 ?plato))
            (not (entregado ?plato))
            (vacio ?plato)
            (sucio ?plato)
            (sobre ?plato ?pila)
            (assign (ingredientes ?plato) 0)
            (sopa-tomate ?plato)
        )
    )

    (:action hacer-sopa-cebolla
        :parameters (?plato - plato ?pila - pila ?cebolla1 ?cebolla2 ?cebolla3 - cebolla)
        :precondition (and
            (not (= ?cebolla1 ?cebolla2))
            (not (= ?cebolla2 ?cebolla3))
            (not (= ?cebolla1 ?cebolla3))
            (cortado ?cebolla1)
            (cortado ?cebolla2)
            (cortado ?cebolla3)
            (cocido3 ?cebolla1 ?cebolla2 ?cebolla3)
            (emplatado3 ?cebolla1 ?cebolla2 ?cebolla3 ?plato)
            (entregado ?plato)
            (not (sucio ?plato))
            (= (ingredientes ?plato) 3)
        )
        :effect (and
            (not (emplatado3 ?cebolla1 ?cebolla2 ?cebolla3 ?plato))
            (not (entregado ?plato))
            (vacio ?plato)
            (sucio ?plato)
            (sobre ?plato ?pila)
            (assign (ingredientes ?plato) 0)
            (sopa-cebolla ?plato)
        )
    )

    (:action hacer-sopa-champinion
        :parameters (?plato - plato ?pila - pila ?champinion1 ?champinion2 ?champinion3 - champinion)
        :precondition (and
            (not (= ?champinion1 ?champinion2))
            (not (= ?champinion2 ?champinion3))
            (not (= ?champinion1 ?champinion3))
            (cortado ?champinion1)
            (cortado ?champinion2)
            (cortado ?champinion3)
            (cocido3 ?champinion1 ?champinion2 ?champinion3)
            (emplatado3 ?champinion1 ?champinion2 ?champinion3 ?plato)
            (entregado ?plato)
            (not (sucio ?plato))
            (= (ingredientes ?plato) 3)
        )
        :effect (and
            (not (emplatado3 ?champinion1 ?champinion2 ?champinion3 ?plato))
            (not (entregado ?plato))
            (vacio ?plato)
            (sucio ?plato)
            (sobre ?plato ?pila)
            (assign (ingredientes ?plato) 0)
            (sopa-champinion ?plato)
        )
    )
)

; problem
(define (problem p06-sopa)
    (:domain overcooked-sopa)
    (:objects
        zona-1 - zona
        limbo-1 - limbo
        zona-2 - zona
        limbo-2 - limbo

        cocinero-1 - cocinero

        tabla-1 - tabla-corte
        tabla-2 - tabla-corte

        multiolla-1 - multiolla
        multiolla-2 - multiolla
        multiolla-3 - multiolla

        fogon-1 - fogon
        fogon-2 - fogon
        fogon-3 - fogon
        
        fregadero - fregadero

        pila - pila
        entregador - entregador

        encimera-comun1-1 - encimera
        encimera-comun1-2 - encimera
        encimera-comun1-3 - encimera
        encimera-comun1-4 - encimera
        encimera-comun1-5 - encimera
        encimera-comun1-6 - encimera
        encimera-comun1-7 - encimera
        encimera-comun1-8 - encimera

        encimera-comun2-1 - encimera
        encimera-comun2-2 - encimera
        encimera-comun2-3 - encimera
        encimera-comun2-4 - encimera
        encimera-comun2-5 - encimera
        encimera-comun2-6 - encimera
        encimera-comun2-7 - encimera
        encimera-comun2-8 - encimera

        encimera-zona1-1 - encimera
        encimera-zona1-2 - encimera
        encimera-zona1-3 - encimera
        encimera-zona1-4 - encimera
        encimera-zona1-5 - encimera
        encimera-zona1-6 - encimera
        encimera-zona1-7 - encimera
        encimera-zona1-8 - encimera
        encimera-zona1-9 - encimera
        encimera-zona1-10 - encimera

        encimera-zona2-1 - encimera
        encimera-zona2-2 - encimera
        encimera-zona2-3 - encimera
        encimera-zona2-4 - encimera
        encimera-zona2-5 - encimera
        encimera-zona2-6 - encimera
        encimera-zona2-7 - encimera
        encimera-zona2-8 - encimera
        encimera-zona2-9 - encimera
        encimera-zona2-10 - encimera

        tomate-1 - tomate
        tomate-2 - tomate
        tomate-3 - tomate
        tomate-4 - tomate
        tomate-5 - tomate
        tomate-6 - tomate
        armario-tomates - armario

        cebolla-1 - cebolla
        cebolla-2 - cebolla
        cebolla-3 - cebolla
        cebolla-4 - cebolla
        cebolla-5 - cebolla
        cebolla-6 - cebolla
        armario-cebollas - armario

        champinion-1 - champinion
        champinion-2 - champinion
        champinion-3 - champinion
        champinion-4 - champinion
        champinion-5 - champinion
        champinion-6 - champinion
        armario-champiniones - armario

        plato-1 - plato
        plato-2 - plato
        plato-3 - plato
    )
    (:init
        (conectadas zona-1 zona-2)
        (conectadas zona-2 zona-1)

        (esta cocinero-1 zona-1)
        (pertenece limbo-1 zona-1)
        (en cocinero-1 limbo-1)
        (libre cocinero-1)

        (pertenece limbo-2 zona-2)

        (pertenece tabla-1 zona-2)
        (pertenece tabla-2 zona-2)

        (pertenece fogon-1 zona-2)
        (pertenece fogon-2 zona-2)
        (pertenece fogon-3 zona-2)

        (pertenece fregadero zona-1)

        (pertenece pila zona-1)
        (pertenece entregador zona-1)

        (pertenece encimera-zona1-1 zona-1)
        (pertenece encimera-zona1-2 zona-1)
        (pertenece encimera-zona1-3 zona-1)
        (pertenece encimera-zona1-4 zona-1)
        (pertenece encimera-zona1-5 zona-1)
        (pertenece encimera-zona1-6 zona-1)
        (pertenece encimera-zona1-7 zona-1)
        (pertenece encimera-zona1-8 zona-1)
        (pertenece encimera-zona1-9 zona-1)
        (pertenece encimera-zona1-10 zona-1)

        (pertenece encimera-zona2-1 zona-2)
        (pertenece encimera-zona2-2 zona-2)
        (pertenece encimera-zona2-3 zona-2)
        (pertenece encimera-zona2-4 zona-2)
        (pertenece encimera-zona2-5 zona-2)
        (pertenece encimera-zona2-6 zona-2)
        (pertenece encimera-zona2-7 zona-2)
        (pertenece encimera-zona2-8 zona-2)
        (pertenece encimera-zona2-9 zona-2)
        (pertenece encimera-zona2-10 zona-2)

        (pertenece encimera-comun1-1 zona-1)
        (pertenece encimera-comun1-2 zona-1)
        (pertenece encimera-comun1-3 zona-1)
        (pertenece encimera-comun1-4 zona-1)
        (pertenece encimera-comun1-5 zona-1)
        (pertenece encimera-comun1-6 zona-1)
        (pertenece encimera-comun1-7 zona-1)
        (pertenece encimera-comun1-8 zona-1)

        (pertenece encimera-comun1-1 zona-2)
        (pertenece encimera-comun1-2 zona-2)
        (pertenece encimera-comun1-3 zona-2)
        (pertenece encimera-comun1-4 zona-2)
        (pertenece encimera-comun1-5 zona-2)
        (pertenece encimera-comun1-6 zona-2)
        (pertenece encimera-comun1-7 zona-2)
        (pertenece encimera-comun1-8 zona-2)

        (pertenece encimera-comun2-1 zona-1)
        (pertenece encimera-comun2-2 zona-1)
        (pertenece encimera-comun2-3 zona-1)
        (pertenece encimera-comun2-4 zona-1)
        (pertenece encimera-comun2-5 zona-1)
        (pertenece encimera-comun2-6 zona-1)
        (pertenece encimera-comun2-7 zona-1)
        (pertenece encimera-comun2-8 zona-1)

        (pertenece encimera-comun2-1 zona-2)
        (pertenece encimera-comun2-2 zona-2)
        (pertenece encimera-comun2-3 zona-2)
        (pertenece encimera-comun2-4 zona-2)
        (pertenece encimera-comun2-5 zona-2)
        (pertenece encimera-comun2-6 zona-2)
        (pertenece encimera-comun2-7 zona-2)
        (pertenece encimera-comun2-8 zona-2)

        (pertenece armario-tomates zona-1)
        (pertenece armario-cebollas zona-1)
        (pertenece armario-champiniones zona-1)

        (prohibido-dejar pila)
        (prohibido-dejar armario-tomates)
        (prohibido-dejar armario-cebollas)
        (prohibido-dejar armario-champiniones)
        (prohibido-dejar entregador)

        (sobre multiolla-1 fogon-1)
        (= (ingredientes multiolla-1) 0)
        (vacio multiolla-1)
        (ocupada fogon-1)
        (sobre multiolla-2 fogon-2)
        (= (ingredientes multiolla-2) 0)
        (vacio multiolla-2)
        (ocupada fogon-2)
        (sobre multiolla-3 fogon-3)
        (= (ingredientes multiolla-3) 0)
        (vacio multiolla-3)
        (ocupada fogon-3)

        (sobre tomate-1 armario-tomates)
        (sobre tomate-2 armario-tomates)
        (sobre tomate-3 armario-tomates)
        (sobre tomate-4 armario-tomates)
        (sobre tomate-5 armario-tomates)
        (sobre tomate-6 armario-tomates)

        (sobre cebolla-1 armario-cebollas)
        (sobre cebolla-2 armario-cebollas)
        (sobre cebolla-3 armario-cebollas)
        (sobre cebolla-4 armario-cebollas)
        (sobre cebolla-5 armario-cebollas)
        (sobre cebolla-6 armario-cebollas)

        (sobre champinion-1 armario-champiniones)
        (sobre champinion-2 armario-champiniones)
        (sobre champinion-3 armario-champiniones)
        (sobre champinion-4 armario-champiniones)
        (sobre champinion-5 armario-champiniones)
        (sobre champinion-6 armario-champiniones)

        (sobre plato-1 encimera-zona1-8)
        (ocupada encimera-zona1-8)
        (= (ingredientes plato-1) 0)
        (vacio plato-1)
        (sobre plato-2 encimera-zona1-9)
        (ocupada encimera-zona1-9)
        (= (ingredientes plato-2) 0)
        (vacio plato-2)
        (sobre plato-3 encimera-comun2-4)
        (ocupada encimera-comun2-4)
        (= (ingredientes plato-3) 0)
        (vacio plato-3)
    )
    (:goal (and
            (sopa-tomate plato-1)
            ; (sopa-cebolla plato-1)
        )
    )
)

; plan
1. (mover cocinero-1 limbo-1 armario-tomates zona-1)
   deleted: (en cocinero-1 limbo-1)
   added: (en cocinero-1 armario-tomates)
   goals met: 0 of 1
2. (coger cocinero-1 tomate-1 armario-tomates)
   deleted: (sobre tomate-1 armario-tomates) (libre cocinero-1)
   added: (lleva cocinero-1 tomate-1)
   goals met: 0 of 1
3. (mover cocinero-1 armario-tomates limbo-1 zona-1)
   deleted: (en cocinero-1 armario-tomates)
   added: (en cocinero-1 limbo-1)
   goals met: 0 of 1
4. (cambiar cocinero-1 limbo-1 limbo-2 zona-1 zona-2)
   deleted: (en cocinero-1 limbo-1) (esta cocinero-1 zona-1)
   added: (en cocinero-1 limbo-2) (esta cocinero-1 zona-2)
   goals met: 0 of 1
5. (mover cocinero-1 limbo-2 fogon-3 zona-2)
   deleted: (en cocinero-1 limbo-2)
   added: (en cocinero-1 fogon-3)
   goals met: 0 of 1
6. (mover cocinero-1 fogon-3 tabla-1 zona-2)
   deleted: (en cocinero-1 fogon-3)
   added: (en cocinero-1 tabla-1)
   goals met: 0 of 1
7. (dejar cocinero-1 tomate-1 tabla-1)
   deleted: (lleva cocinero-1 tomate-1)
   added: (ocupada tabla-1) (sobre tomate-1 tabla-1) (libre cocinero-1)
   goals met: 0 of 1
8. (cortar cocinero-1 tomate-1 tabla-1)
   added: (cortado tomate-1)
   goals met: 0 of 1
9. (coger cocinero-1 tomate-1 tabla-1)
   deleted: (ocupada tabla-1) (sobre tomate-1 tabla-1) (libre cocinero-1)
   added: (lleva cocinero-1 tomate-1)
   goals met: 0 of 1
10. (mover cocinero-1 tabla-1 fogon-3 zona-2)
   deleted: (en cocinero-1 tabla-1)
   added: (en cocinero-1 fogon-3)
   goals met: 0 of 1
11. (echar-multiple cocinero-1 tomate-1 multiolla-3 fogon-3)
   deleted: (lleva cocinero-1 tomate-1) (vacio multiolla-3)
   added: (libre cocinero-1) (echado-multiple tomate-1 multiolla-3)
   changed: (ingredientes multiolla-3) from 0 to 1
   goals met: 0 of 1
12. (mover cocinero-1 fogon-3 limbo-2 zona-2)
   deleted: (en cocinero-1 fogon-3)
   added: (en cocinero-1 limbo-2)
   goals met: 0 of 1
13. (cambiar cocinero-1 limbo-2 limbo-1 zona-2 zona-1)
   deleted: (en cocinero-1 limbo-2) (esta cocinero-1 zona-2)
   added: (en cocinero-1 limbo-1) (esta cocinero-1 zona-1)
   goals met: 0 of 1
14. (mover cocinero-1 limbo-1 armario-tomates zona-1)
   deleted: (en cocinero-1 limbo-1)
   added: (en cocinero-1 armario-tomates)
   goals met: 0 of 1
15. (coger cocinero-1 tomate-2 armario-tomates)
   deleted: (sobre tomate-2 armario-tomates) (libre cocinero-1)
   added: (lleva cocinero-1 tomate-2)
   goals met: 0 of 1
16. (mover cocinero-1 armario-tomates limbo-1 zona-1)
   deleted: (en cocinero-1 armario-tomates)
   added: (en cocinero-1 limbo-1)
   goals met: 0 of 1
17. (cambiar cocinero-1 limbo-1 limbo-2 zona-1 zona-2)
   deleted: (en cocinero-1 limbo-1) (esta cocinero-1 zona-1)
   added: (en cocinero-1 limbo-2) (esta cocinero-1 zona-2)
   goals met: 0 of 1
18. (mover cocinero-1 limbo-2 fogon-3 zona-2)
   deleted: (en cocinero-1 limbo-2)
   added: (en cocinero-1 fogon-3)
   goals met: 0 of 1
19. (mover cocinero-1 fogon-3 tabla-1 zona-2)
   deleted: (en cocinero-1 fogon-3)
   added: (en cocinero-1 tabla-1)
   goals met: 0 of 1
20. (dejar cocinero-1 tomate-2 tabla-1)
   deleted: (lleva cocinero-1 tomate-2)
   added: (ocupada tabla-1) (sobre tomate-2 tabla-1) (libre cocinero-1)
   goals met: 0 of 1
21. (cortar cocinero-1 tomate-2 tabla-1)
   added: (cortado tomate-2)
   goals met: 0 of 1
22. (coger cocinero-1 tomate-2 tabla-1)
   deleted: (ocupada tabla-1) (sobre tomate-2 tabla-1) (libre cocinero-1)
   added: (lleva cocinero-1 tomate-2)
   goals met: 0 of 1
23. (mover cocinero-1 tabla-1 fogon-3 zona-2)
   deleted: (en cocinero-1 tabla-1)
   added: (en cocinero-1 fogon-3)
   goals met: 0 of 1
24. (echar-multiple cocinero-1 tomate-2 multiolla-3 fogon-3)
   deleted: (lleva cocinero-1 tomate-2)
   added: (libre cocinero-1) (echado-multiple tomate-2 multiolla-3)
   changed: (ingredientes multiolla-3) from 1 to 2
   goals met: 0 of 1
25. (mover cocinero-1 fogon-3 limbo-2 zona-2)
   deleted: (en cocinero-1 fogon-3)
   added: (en cocinero-1 limbo-2)
   goals met: 0 of 1
26. (cambiar cocinero-1 limbo-2 limbo-1 zona-2 zona-1)
   deleted: (en cocinero-1 limbo-2) (esta cocinero-1 zona-2)
   added: (en cocinero-1 limbo-1) (esta cocinero-1 zona-1)
   goals met: 0 of 1
27. (mover cocinero-1 limbo-1 armario-tomates zona-1)
   deleted: (en cocinero-1 limbo-1)
   added: (en cocinero-1 armario-tomates)
   goals met: 0 of 1
28. (coger cocinero-1 tomate-3 armario-tomates)
   deleted: (sobre tomate-3 armario-tomates) (libre cocinero-1)
   added: (lleva cocinero-1 tomate-3)
   goals met: 0 of 1
29. (mover cocinero-1 armario-tomates encimera-zona1-8 zona-1)
   deleted: (en cocinero-1 armario-tomates)
   added: (en cocinero-1 encimera-zona1-8)
   goals met: 0 of 1
30. (mover cocinero-1 encimera-zona1-8 limbo-1 zona-1)
   deleted: (en cocinero-1 encimera-zona1-8)
   added: (en cocinero-1 limbo-1)
   goals met: 0 of 1
31. (cambiar cocinero-1 limbo-1 limbo-2 zona-1 zona-2)
   deleted: (en cocinero-1 limbo-1) (esta cocinero-1 zona-1)
   added: (en cocinero-1 limbo-2) (esta cocinero-1 zona-2)
   goals met: 0 of 1
32. (mover cocinero-1 limbo-2 fogon-3 zona-2)
   deleted: (en cocinero-1 limbo-2)
   added: (en cocinero-1 fogon-3)
   goals met: 0 of 1
33. (mover cocinero-1 fogon-3 tabla-1 zona-2)
   deleted: (en cocinero-1 fogon-3)
   added: (en cocinero-1 tabla-1)
   goals met: 0 of 1
34. (dejar cocinero-1 tomate-3 tabla-1)
   deleted: (lleva cocinero-1 tomate-3)
   added: (ocupada tabla-1) (sobre tomate-3 tabla-1) (libre cocinero-1)
   goals met: 0 of 1
35. (cortar cocinero-1 tomate-3 tabla-1)
   added: (cortado tomate-3)
   goals met: 0 of 1
36. (coger cocinero-1 tomate-3 tabla-1)
   deleted: (ocupada tabla-1) (sobre tomate-3 tabla-1) (libre cocinero-1)
   added: (lleva cocinero-1 tomate-3)
   goals met: 0 of 1
37. (mover cocinero-1 tabla-1 fogon-3 zona-2)
   deleted: (en cocinero-1 tabla-1)
   added: (en cocinero-1 fogon-3)
   goals met: 0 of 1
38. (echar-multiple cocinero-1 tomate-3 multiolla-3 fogon-3)
   deleted: (lleva cocinero-1 tomate-3)
   added: (libre cocinero-1) (echado-multiple tomate-3 multiolla-3)
   changed: (ingredientes multiolla-3) from 2 to 3
   goals met: 0 of 1
39. (cocer3 cocinero-1 tomate-1 tomate-2 tomate-3 multiolla-3 fogon-3)
   added: (cocido3 tomate-1 tomate-2 tomate-3)
   goals met: 0 of 1
40. (coger cocinero-1 multiolla-3 fogon-3)
   deleted: (ocupada fogon-3) (sobre multiolla-3 fogon-3) (libre cocinero-1)
   added: (lleva cocinero-1 multiolla-3)
   goals met: 0 of 1
41. (mover cocinero-1 fogon-3 limbo-2 zona-2)
   deleted: (en cocinero-1 fogon-3)
   added: (en cocinero-1 limbo-2)
   goals met: 0 of 1
42. (cambiar cocinero-1 limbo-2 limbo-1 zona-2 zona-1)
   deleted: (en cocinero-1 limbo-2) (esta cocinero-1 zona-2)
   added: (en cocinero-1 limbo-1) (esta cocinero-1 zona-1)
   goals met: 0 of 1
43. (mover cocinero-1 limbo-1 encimera-zona1-8 zona-1)
   deleted: (en cocinero-1 limbo-1)
   added: (en cocinero-1 encimera-zona1-8)
   goals met: 0 of 1
44. (emplatar-util3 cocinero-1 plato-1 encimera-zona1-8 multiolla-3 tomate-1 tomate-2 tomate-3)
   deleted: (echado-multiple tomate-1 multiolla-3) (echado-multiple tomate-2 multiolla-3) (echado-multiple tomate-3 multiolla-3) (vacio plato-1)
   added: (vacio multiolla-3) (sucio multiolla-3) (emplatado3 tomate-1 tomate-2 tomate-3 plato-1)
   changed: (ingredientes multiolla-3) from 3 to 0, (ingredientes plato-1) from 0 to 3
   goals met: 0 of 1
45. (mover cocinero-1 encimera-zona1-8 limbo-1 zona-1)
   deleted: (en cocinero-1 encimera-zona1-8)
   added: (en cocinero-1 limbo-1)
   goals met: 0 of 1
46. (dejar cocinero-1 multiolla-3 limbo-1)
   deleted: (lleva cocinero-1 multiolla-3)
   added: (ocupada limbo-1) (sobre multiolla-3 limbo-1) (libre cocinero-1)
   goals met: 0 of 1
47. (mover cocinero-1 limbo-1 encimera-zona1-8 zona-1)
   deleted: (en cocinero-1 limbo-1)
   added: (en cocinero-1 encimera-zona1-8)
   goals met: 0 of 1
48. (coger cocinero-1 plato-1 encimera-zona1-8)
   deleted: (ocupada encimera-zona1-8) (sobre plato-1 encimera-zona1-8) (libre cocinero-1)
   added: (lleva cocinero-1 plato-1)
   goals met: 0 of 1
49. (mover cocinero-1 encimera-zona1-8 entregador zona-1)
   deleted: (en cocinero-1 encimera-zona1-8)
   added: (en cocinero-1 entregador)
   goals met: 0 of 1
50. (entregar cocinero-1 plato-1 entregador)
   deleted: (lleva cocinero-1 plato-1)
   added: (entregado plato-1) (libre cocinero-1)
   goals met: 0 of 1
51. (hacer-sopa-tomate plato-1 pila tomate-1 tomate-2 tomate-3)
   deleted: (emplatado3 tomate-1 tomate-2 tomate-3 plato-1) (entregado plato-1)
   added: (vacio plato-1) (sucio plato-1) (sobre plato-1 pila) (sopa-tomate plato-1)
   changed: (ingredientes plato-1) from 3 to 0
   goals met: 1 of 1
